{
    "recipeName": "Cast Iron Chicken Breast",
    "timeToPrepare": "20m",
    "timeToCook": "20m",
    "timeToServe" : "5m",
    "servings": "4",
    "calories": "it's over 9000!!!",
    "rating": [],
    "usersMade": [],
    "media": [],
    "ingridients": {
        "Chicken Breast" : "1",
        "Pepper" : "1/2 Cup",
        "Sweet Paprika": "1/2 Cup",
        "Salt": "1/2 Cup",
        "Butter": "30 Gram",
        "Cooking Oil": "3 Tablespoon",
        "Eggs": "1"
    },
    "instructions": [
        "First, you must cut up the chicken breast to mediumly-thinned slices, such as in fig. 1",
        "Next, take a sturdy cutting board (preferably thick wood) and spread the pieces of the breast evenly across the board, as if you're making a puzzle. see fig. 2",
        "Spread pepper, paprika and salt in any particular order, volume and concentration across individual pieces of the breast. Try not to overseason.",
        "Cover the entire cutting board with a layer of sealing plastic, the kind you use to store food in the fridge with. During tenderizing, we do not want to get ourselves or the kitchen dirty, as the meat contains liquids that may shoot out, along with your seasoning, across the entire kitchen.",
        "Proceed to tenderize the meat with a steel-tipped mallet. Cover as much ground as possible, and use medium force. Let the weight of the mallet perform most of the work, lest you tire yourself.",
        "After you've finished one side of the meat, prepare your cast iron pan. Apply adequate heat, butter and cooking oil. Then reduce the heating, to prevent the butter from burning out while still tenderizing.",
        "Break an egg into a bowl as close as possible to the iron pan, and mix the egg. Add another plate at another side of the cast iron pan to put away finished meat. Keep in mind, the following steps 8-10 may be repeated several times during the cooking process.",
        "After turning on the gas for the cast iron pan, remove the plastic, flip the meat, season as in step 3, and repeat until both sides of each slice are tenderized and no meat is left.",
        "The iron pan should be prepared. Take your slices of chicken breast, dip them in the egg, and lay onto the pan.",
        "Fill the pan with chicken. Check if the chicken has been adequately cooked before flipping them, and if already flipped, place the slice onto the plate besides the pan.",
        "Repeat steps 8-10 until you've cooked all of your meat."
    ],
    "serving": "To serve the meat, you are suggested to apply mayonnaise and mustard in the plate- alongside the meat. You may also serve with vegetables and tea. This should not take more than 5 minutes, unless you have a side dish to serve (uncovered here)."
}